Tekla Open API Reference for Tekla Structures 2025
Polygon Fields
The Polygon type exposes the following members.
Fields
Name | Description
MAX_POLYGON_POINTS
 The maximum number of polygon points that is typically valid in Tekla Structures.
MIN_POLYGON_POINTS
 The minimum number of polygon points that is typically valid in Tekla Structures.
Top
See Also
Reference
Polygon Class
Tekla.Structures.Model Namespace